//
//  Posts.swift
//  Navigation
//
//  Created by Екатерина Смекалова on 30.03.2022.
//

import Foundation

let images: [String] = ["0","1","2","3","4","5","6","7","8","9", "10","11","12","13","14","15","16","17","18","19"]

var posts = [
    Post(id: 0, title: "Круглый пруд Ботанического сада Петра Великого", author: "geosmeka", description: "В 1712 году из Москвы в Санкт-Петербург на Вороний остров был переведен Аптекарский приказ — учреждение, ведавшее всем медицинским и аптечным делом. В 1714 году Петром I был учрежден Аптекарский огород, где выращивали лекарственные травы и диковинные растения иностранцы, а Вороний остров стал называться Аптекарским.", image: "0", likes: 100, views: 1000),
    Post(id: 1, title: "Ежегодный Сиреневый фестиваль", author: "geosmeka", description: "Ежегодно в Ботаническом саду Петра Великого в Санкт-Петербурге проходит Сиреневый фестиваль. Аромат цветов и вкус сиреневого мороженого зимой! Сирень - род кустарников, принадлежащий семейству Маслиновые. Род включает около тридцати видов, распространённых в диком состоянии в Юго-Восточной Европе и в Азии, преимущественно в Китае. Своё родовое название сирень получила в честь одного из персонажей древнегреческой мифологии — наяды Сиринги.", image: "1", likes: 100, views: 1000),
    Post(id: 2, title: "Тюльпаны из коллекции БИН РАН", author: "geosmeka", description: "Род многолетних травянистых луковичных растений семейства Лилейные, в современных систематиках включающий более 80 видов. Центр происхождения и наибольшего разнообразия видов тюльпанов - горы северного Ирана, Памиро-Алай и Тянь-Шань. За 10-15 миллионов лет эволюции тюльпаны расселились до Испании и Марокко на западе, до Забайкалья на востоке и до Синайского полуострова на юге. На севере интродуцированные человеком популяции тюльпана лесного достигли Шотландии и южного побережья Скандинавии.", image: "2", likes: 100, views: 1000),
    Post(id: 3, title: "Сирень пушистая", author: "geosmeka", description: "Произрастает в горах на высоте 1200—2400 м над уровнем моря. В культуре используется с 1880 года. Ценится за раннее цветение и ароматные цветки. Используется для озеленения склонов. В дикой природе сирень пушистая распространена в Китае — провинции Ганьсу, Хэбэй, Хубэй, Гирин, Ляонин, Цинхай, Шаньси, Шаньдун, Шэньси, Сычуань и в Корее.", image: "3", likes: 100, views: 1000)
]
